
## Plan Result

[CI link](https://github.com/MurakamiHonami/streeeak/actions/runs/23102578914)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_ecs_service.backend
* Replace
  * aws_ecs_task_definition.backend


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.backend will be updated in-place
  ~ resource "aws_ecs_service" "backend" {
        id                                 = "arn:aws:ecs:ap-northeast-1:382715181910:service/streeeak-prod-cluster/streeeak-backend-service"
        name                               = "streeeak-backend-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:382715181910:task-definition/streeeak-backend-task:15" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.backend must be replaced
-/+ resource "aws_ecs_task_definition" "backend" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:382715181910:task-definition/streeeak-backend-task:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:382715181910:task-definition/streeeak-backend-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "streeeak-backend-task" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"81a89e92c6cbcc88e6236f913f24b877de94f820","Vars":{},"WorkflowName":"Terraform Deploy"} -->